In [2]:
import pandas as pd

In [3]:
trnsact = pd.read_csv('trnsact.csv', sep=',', header= None,
                    #    dtype={'STORE':'int', 'SKU':'int', 'COST':'float', 'RETAIL':'float', 'Unknown':'int'},
                       names=['SKU', 'STORE', 'REGISTER', 'TRANNUM', 'INTERID', 'SALEDATE', 'STYPE', 'QUANTITY', 'ORGPRICE', 'SPRICE', 'AMT', 'SEQ', 'MIC', 'Unknown'])

In [5]:
trnsact.head()

,SKU,STORE,REGISTER,TRANNUM,INTERID,SALEDATE,STYPE,QUANTITY,ORGPRICE,SPRICE,AMT,SEQ,MIC,Unknown
0,3,202,290,1100,326708721,2005-01-18,P,1,0.0,30.0,30.0,3500000,818,0
1,3,202,540,2700,326708721,2005-01-29,R,1,0.0,30.0,30.0,15200000,818,0
2,3,303,500,2100,23702074,2004-08-18,P,1,0.0,12.0,12.0,4600000,48,0
3,3,709,360,500,0,2005-08-14,P,1,0.0,30.0,30.0,6500000,818,0
4,3,802,660,400,0,2005-08-09,P,1,440.0,30.0,30.0,4700000,599,0

In [6]:
data_types = trnsact.dtypes

print(data_types)

SKU           int64
STORE         int64
REGISTER      int64
TRANNUM       int64
INTERID       int64
SALEDATE     object
STYPE        object
QUANTITY      int64
ORGPRICE    float64
SPRICE      float64
AMT         float64
SEQ           int64
MIC           int64
Unknown       int64
dtype: object

In [7]:
trnsact.isnull().sum()/len(trnsact)*100

SKU         0.0
STORE       0.0
REGISTER    0.0
TRANNUM     0.0
INTERID     0.0
SALEDATE    0.0
STYPE       0.0
QUANTITY    0.0
ORGPRICE    0.0
SPRICE      0.0
AMT         0.0
SEQ         0.0
MIC         0.0
Unknown     0.0
dtype: float64

No missing values in the data set

In [8]:
sum(trnsact['SPRICE'] == trnsact['AMT']) / len(trnsact)

0.9999999421090002

AMT and SPRICE are pretty much the same, we easily drop SPRICE, and drop unknown as well

In [9]:
trnsact = trnsact.drop(columns=['SPRICE'])
trnsact = trnsact.drop(columns=['Unknown'])

In [10]:
trnsact

,SKU,STORE,REGISTER,TRANNUM,INTERID,SALEDATE,STYPE,QUANTITY,ORGPRICE,AMT,SEQ,MIC
0,3,202,290,1100,326708721,2005-01-18,P,1,0.0,30.00,3500000,818
1,3,202,540,2700,326708721,2005-01-29,R,1,0.0,30.00,15200000,818
2,3,303,500,2100,23702074,2004-08-18,P,1,0.0,12.00,4600000,48
3,3,709,360,500,0,2005-08-14,P,1,0.0,30.00,6500000,818
4,3,802,660,400,0,2005-08-09,P,1,440.0,30.00,4700000,599
...,...,...,...,...,...,...,...,...,...,...,...,...
120916891,9999997,7507,750,2800,0,2005-04-23,P,1,39.0,39.00,593900116,395
120916892,9999997,7907,790,3200,0,2005-05-03,P,1,39.0,39.00,502600061,395
120916893,9999997,7907,800,700,0,2005-05-04,R,1,39.0,39.00,600900066,395
120916894,9999997,7907,800,700,0,2005-05-04,P,1,39.0,39.00,601000066,395
120916895,9999997,7907,800,4100,257808914,2005-07-31,P,1,39.0,26.13,658600082,395

In [11]:
trnsact['SALEDATE'] = pd.to_datetime(trnsact['SALEDATE'])
trnsact['STYPE'] = trnsact['STYPE'].astype(str)

In [12]:
stype_all_string = trnsact['STYPE'].apply(lambda x: isinstance(x, str)).all()
stype_all_string

True

In [13]:
orgprice0 = (trnsact['ORGPRICE'] == 0).sum()
# there are 1425811 rows that have ORGPRICE as 0
orgprice0

1425811

In [14]:
trnsact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120916896 entries, 0 to 120916895
Data columns (total 12 columns):
 #   Column    Dtype
---  ------    -----
 0   SKU       int64
 1   STORE     int64
 2   REGISTER  int64
 3   TRANNUM   int64
 4   INTERID   int64
 5   SALEDATE  datetime64[ns]
 6   STYPE     object
 7   QUANTITY  int64
 8   ORGPRICE  float64
 9   AMT       float64
 10  SEQ       int64
 11  MIC       int64
dtypes: datetime64[ns](1), float64(2), int64(8), object(1)
memory usage: 10.8+ GB

In [15]:
trnsact.to_csv('trnsact_clean.csv', index=False)